<details>
<summary>Execution result of "run --all plan" in "."</summary>

```terraform
00:23:20.614 INFO   The stack at . will be processed in the following order for command plan:
Group 1
- Module ./management-account/eu-west-1/s3
- Module ./management-account/global-infra/organization-accounts
- Module ./playground-account/eu-west-1/s3
- Module ./test-account/eu-west-1/s3


00:23:20.736 INFO   [test-account/eu-west-1/s3] Downloading Terraform configurations from ./modules/s3 into ./test-account/eu-west-1/s3/.terragrunt-cache/FIgbXJVdUJAkmsa6YIf24Zbjalw/p0hmT_yU9GfVIbcsvydhmNhIJWg
00:23:20.769 INFO   [playground-account/eu-west-1/s3] Downloading Terraform configurations from ./modules/s3 into ./playground-account/eu-west-1/s3/.terragrunt-cache/Ife-siSQSkZudNuf1ioRzK__ydI/p0hmT_yU9GfVIbcsvydhmNhIJWg
00:23:20.781 INFO   [management-account/global-infra/organization-accounts] Downloading Terraform configurations from ./modules/organization-account into ./management-account/global-infra/organization-accounts/.terragrunt-cache/3XLPvzLN2Hf8668drqHKYhDUbDk/Yycl6dC0BtLQ-XFNjTw2ySiFaUQ
00:23:20.786 INFO   [management-account/eu-west-1/s3] Downloading Terraform configurations from ./modules/s3 into ./management-account/eu-west-1/s3/.terragrunt-cache/6O7bSTWfYv7WPnJvTEak2cevHGQ/p0hmT_yU9GfVIbcsvydhmNhIJWg
00:23:21.635 INFO   [playground-account/eu-west-1/s3] terraform: Initializing the backend...
00:23:21.635 INFO   [management-account/global-infra/organization-accounts] terraform: Initializing the backend...
00:23:21.641 INFO   [management-account/eu-west-1/s3] terraform: Initializing the backend...
00:23:21.642 INFO   [test-account/eu-west-1/s3] terraform: Initializing the backend...
00:23:22.874 INFO   [playground-account/eu-west-1/s3] terraform: 
00:23:22.874 INFO   [playground-account/eu-west-1/s3] terraform: Successfully configured the backend "s3"! Terraform will automatically
00:23:22.874 INFO   [playground-account/eu-west-1/s3] terraform: use this backend unless the backend configuration changes.
00:23:22.949 INFO   [management-account/global-infra/organization-accounts] terraform: 
00:23:22.949 INFO   [management-account/global-infra/organization-accounts] terraform: Successfully configured the backend "s3"! Terraform will automatically
00:23:22.949 INFO   [management-account/global-infra/organization-accounts] terraform: use this backend unless the backend configuration changes.
00:23:22.972 INFO   [test-account/eu-west-1/s3] terraform: 
00:23:22.972 INFO   [test-account/eu-west-1/s3] terraform: Successfully configured the backend "s3"! Terraform will automatically
00:23:22.972 INFO   [test-account/eu-west-1/s3] terraform: use this backend unless the backend configuration changes.
00:23:23.019 INFO   [management-account/eu-west-1/s3] terraform: 
00:23:23.019 INFO   [management-account/eu-west-1/s3] terraform: Successfully configured the backend "s3"! Terraform will automatically
00:23:23.019 INFO   [management-account/eu-west-1/s3] terraform: use this backend unless the backend configuration changes.
00:23:23.365 INFO   [playground-account/eu-west-1/s3] terraform: Initializing provider plugins...
00:23:23.365 INFO   [playground-account/eu-west-1/s3] terraform: - Finding latest version of hashicorp/aws...
00:23:23.438 INFO   [management-account/global-infra/organization-accounts] terraform: Initializing provider plugins...
00:23:23.438 INFO   [management-account/global-infra/organization-accounts] terraform: - Finding latest version of hashicorp/aws...
00:23:23.463 INFO   [test-account/eu-west-1/s3] terraform: Initializing provider plugins...
00:23:23.463 INFO   [test-account/eu-west-1/s3] terraform: - Finding latest version of hashicorp/aws...
00:23:23.533 INFO   [management-account/eu-west-1/s3] terraform: Initializing provider plugins...
00:23:23.533 INFO   [management-account/eu-west-1/s3] terraform: - Finding latest version of hashicorp/aws...
00:23:23.576 INFO   [playground-account/eu-west-1/s3] terraform: - Installing hashicorp/aws v6.2.0...
00:23:23.612 INFO   [management-account/global-infra/organization-accounts] terraform: - Installing hashicorp/aws v6.2.0...
00:23:23.690 INFO   [management-account/eu-west-1/s3] terraform: - Installing hashicorp/aws v6.2.0...
00:23:23.735 INFO   [test-account/eu-west-1/s3] terraform: - Installing hashicorp/aws v6.2.0...
00:23:29.858 INFO   [management-account/eu-west-1/s3] terraform: - Installed hashicorp/aws v6.2.0 (signed by HashiCorp)
00:23:29.858 INFO   [management-account/eu-west-1/s3] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
00:23:29.858 INFO   [management-account/eu-west-1/s3] terraform: selections it made above. Include this file in your version control repository
00:23:29.859 INFO   [management-account/eu-west-1/s3] terraform: so that Terraform can guarantee to make the same selections by default when
00:23:29.859 INFO   [management-account/eu-west-1/s3] terraform: you run "terraform init" in the future.
00:23:29.859 INFO   [management-account/eu-west-1/s3] terraform: Terraform has been successfully initialized!
00:23:30.078 INFO   [management-account/global-infra/organization-accounts] terraform: - Installed hashicorp/aws v6.2.0 (signed by HashiCorp)
00:23:30.078 INFO   [management-account/global-infra/organization-accounts] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
00:23:30.078 INFO   [management-account/global-infra/organization-accounts] terraform: selections it made above. Include this file in your version control repository
00:23:30.078 INFO   [management-account/global-infra/organization-accounts] terraform: so that Terraform can guarantee to make the same selections by default when
00:23:30.078 INFO   [management-account/global-infra/organization-accounts] terraform: you run "terraform init" in the future.
00:23:30.222 INFO   [management-account/global-infra/organization-accounts] terraform: Terraform has been successfully initialized!
00:23:30.279 INFO   [playground-account/eu-west-1/s3] terraform: - Installed hashicorp/aws v6.2.0 (signed by HashiCorp)
00:23:30.279 INFO   [playground-account/eu-west-1/s3] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
00:23:30.279 INFO   [playground-account/eu-west-1/s3] terraform: selections it made above. Include this file in your version control repository
00:23:30.279 INFO   [playground-account/eu-west-1/s3] terraform: so that Terraform can guarantee to make the same selections by default when
00:23:30.279 INFO   [playground-account/eu-west-1/s3] terraform: you run "terraform init" in the future.
00:23:30.279 INFO   [playground-account/eu-west-1/s3] terraform: Terraform has been successfully initialized!
00:23:30.292 INFO   [test-account/eu-west-1/s3] terraform: - Installed hashicorp/aws v6.2.0 (signed by HashiCorp)
00:23:30.293 INFO   [test-account/eu-west-1/s3] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
00:23:30.293 INFO   [test-account/eu-west-1/s3] terraform: selections it made above. Include this file in your version control repository
00:23:30.293 INFO   [test-account/eu-west-1/s3] terraform: so that Terraform can guarantee to make the same selections by default when
00:23:30.293 INFO   [test-account/eu-west-1/s3] terraform: you run "terraform init" in the future.
00:23:30.293 INFO   [test-account/eu-west-1/s3] terraform: Terraform has been successfully initialized!
00:23:36.082 STDOUT [management-account/eu-west-1/s3] terraform: aws_s3_bucket.this["ma-test-bucket-terragrunt-main-account"]: Refreshing state... [id=ma-test-bucket-terragrunt-main-account]
00:23:36.655 STDOUT [management-account/global-infra/organization-accounts] terraform: aws_organizations_account.this: Refreshing state... [id=929864627295]
00:23:37.580 STDOUT [management-account/global-infra/organization-accounts] terraform: No changes. Your infrastructure matches the configuration.
00:23:37.581 STDOUT [management-account/global-infra/organization-accounts] terraform: Terraform has compared your real infrastructure against your configuration
00:23:37.581 STDOUT [management-account/global-infra/organization-accounts] terraform: and found no differences, so no changes are needed.
00:23:37.587 STDOUT [test-account/eu-west-1/s3] terraform: Terraform used the selected providers to generate the following execution
00:23:37.588 STDOUT [test-account/eu-west-1/s3] terraform: plan. Resource actions are indicated with the following symbols:
00:23:37.588 STDOUT [test-account/eu-west-1/s3] terraform:   + create
00:23:37.588 STDOUT [test-account/eu-west-1/s3] terraform: Terraform will perform the following actions:
00:23:37.589 STDOUT [test-account/eu-west-1/s3] terraform:   # aws_s3_bucket.this["ma-test-bucket-terragrunt-test-account"] will be created
00:23:37.589 STDOUT [test-account/eu-west-1/s3] terraform:   + resource "aws_s3_bucket" "this" {
00:23:37.589 STDOUT [test-account/eu-west-1/s3] terraform:       + acceleration_status         = (known after apply)
00:23:37.590 STDOUT [test-account/eu-west-1/s3] terraform:       + acl                         = (known after apply)
00:23:37.590 STDOUT [test-account/eu-west-1/s3] terraform:       + arn                         = (known after apply)
00:23:37.590 STDOUT [test-account/eu-west-1/s3] terraform:       + bucket                      = "ma-test-bucket-terragrunt-test-account"
00:23:37.590 STDOUT [test-account/eu-west-1/s3] terraform:       + bucket_domain_name          = (known after apply)
00:23:37.590 STDOUT [test-account/eu-west-1/s3] terraform:       + bucket_prefix               = (known after apply)
00:23:37.590 STDOUT [test-account/eu-west-1/s3] terraform:       + bucket_region               = (known after apply)
00:23:37.590 STDOUT [test-account/eu-west-1/s3] terraform:       + bucket_regional_domain_name = (known after apply)
00:23:37.590 STDOUT [test-account/eu-west-1/s3] terraform:       + force_destroy               = false
00:23:37.590 STDOUT [test-account/eu-west-1/s3] terraform:       + hosted_zone_id              = (known after apply)
00:23:37.590 STDOUT [test-account/eu-west-1/s3] terraform:       + id                          = (known after apply)
00:23:37.590 STDOUT [test-account/eu-west-1/s3] terraform:       + object_lock_enabled         = (known after apply)
00:23:37.590 STDOUT [test-account/eu-west-1/s3] terraform:       + policy                      = (known after apply)
00:23:37.590 STDOUT [test-account/eu-west-1/s3] terraform:       + region                      = "eu-west-1"
00:23:37.590 STDOUT [test-account/eu-west-1/s3] terraform:       + request_payer               = (known after apply)
00:23:37.590 STDOUT [test-account/eu-west-1/s3] terraform:       + tags                        = {
00:23:37.590 STDOUT [test-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
00:23:37.591 STDOUT [test-account/eu-west-1/s3] terraform:           + "Name"        = "ma-test-bucket-tag-test-account"
00:23:37.591 STDOUT [test-account/eu-west-1/s3] terraform:         }
00:23:37.591 STDOUT [test-account/eu-west-1/s3] terraform:       + tags_all                    = {
00:23:37.591 STDOUT [test-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
00:23:37.591 STDOUT [test-account/eu-west-1/s3] terraform:           + "Name"        = "ma-test-bucket-tag-test-account"
00:23:37.591 STDOUT [test-account/eu-west-1/s3] terraform:         }
00:23:37.591 STDOUT [test-account/eu-west-1/s3] terraform:       + website_domain              = (known after apply)
00:23:37.591 STDOUT [test-account/eu-west-1/s3] terraform:       + website_endpoint            = (known after apply)
00:23:37.591 STDOUT [test-account/eu-west-1/s3] terraform:       + cors_rule (known after apply)
00:23:37.591 STDOUT [test-account/eu-west-1/s3] terraform:       + grant (known after apply)
00:23:37.591 STDOUT [test-account/eu-west-1/s3] terraform:       + lifecycle_rule (known after apply)
00:23:37.591 STDOUT [test-account/eu-west-1/s3] terraform:       + logging (known after apply)
00:23:37.591 STDOUT [test-account/eu-west-1/s3] terraform:       + object_lock_configuration (known after apply)
00:23:37.591 STDOUT [test-account/eu-west-1/s3] terraform:       + replication_configuration (known after apply)
00:23:37.591 STDOUT [test-account/eu-west-1/s3] terraform:       + server_side_encryption_configuration (known after apply)
00:23:37.591 STDOUT [test-account/eu-west-1/s3] terraform:       + versioning (known after apply)
00:23:37.591 STDOUT [test-account/eu-west-1/s3] terraform:       + website (known after apply)
00:23:37.591 STDOUT [test-account/eu-west-1/s3] terraform:     }
00:23:37.591 STDOUT [test-account/eu-west-1/s3] terraform: Plan: 1 to add, 0 to change, 0 to destroy.
00:23:37.592 STDOUT [test-account/eu-west-1/s3] terraform: 
00:23:37.592 STDOUT [test-account/eu-west-1/s3] terraform: Changes to Outputs:
00:23:37.592 STDOUT [test-account/eu-west-1/s3] terraform:   + bucket_id = {
00:23:37.592 STDOUT [test-account/eu-west-1/s3] terraform:       + ma-test-bucket-terragrunt-test-account = (known after apply)
00:23:37.592 STDOUT [test-account/eu-west-1/s3] terraform:     }
00:23:37.677 STDOUT [playground-account/eu-west-1/s3] terraform: Terraform used the selected providers to generate the following execution
00:23:37.677 STDOUT [playground-account/eu-west-1/s3] terraform: plan. Resource actions are indicated with the following symbols:
00:23:37.677 STDOUT [playground-account/eu-west-1/s3] terraform:   + create
00:23:37.677 STDOUT [playground-account/eu-west-1/s3] terraform: Terraform will perform the following actions:
00:23:37.678 STDOUT [playground-account/eu-west-1/s3] terraform:   # aws_s3_bucket.this["test-bucket-one-mo-altamash"] will be created
00:23:37.678 STDOUT [playground-account/eu-west-1/s3] terraform:   + resource "aws_s3_bucket" "this" {
00:23:37.678 STDOUT [playground-account/eu-west-1/s3] terraform:       + acceleration_status         = (known after apply)
00:23:37.678 STDOUT [playground-account/eu-west-1/s3] terraform:       + acl                         = (known after apply)
00:23:37.678 STDOUT [playground-account/eu-west-1/s3] terraform:       + arn                         = (known after apply)
00:23:37.678 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket                      = "test-bucket-one-mo-altamash"
00:23:37.678 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_domain_name          = (known after apply)
00:23:37.678 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_prefix               = (known after apply)
00:23:37.678 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_region               = (known after apply)
00:23:37.678 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_regional_domain_name = (known after apply)
00:23:37.678 STDOUT [playground-account/eu-west-1/s3] terraform:       + force_destroy               = false
00:23:37.678 STDOUT [playground-account/eu-west-1/s3] terraform:       + hosted_zone_id              = (known after apply)
00:23:37.678 STDOUT [playground-account/eu-west-1/s3] terraform:       + id                          = (known after apply)
00:23:37.678 STDOUT [playground-account/eu-west-1/s3] terraform:       + object_lock_enabled         = (known after apply)
00:23:37.678 STDOUT [playground-account/eu-west-1/s3] terraform:       + policy                      = (known after apply)
00:23:37.678 STDOUT [playground-account/eu-west-1/s3] terraform:       + region                      = "eu-west-1"
00:23:37.678 STDOUT [playground-account/eu-west-1/s3] terraform:       + request_payer               = (known after apply)
00:23:37.678 STDOUT [playground-account/eu-west-1/s3] terraform:       + tags                        = {
00:23:37.678 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
00:23:37.678 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Name"        = "test-bucket-tag-maltamash"
00:23:37.678 STDOUT [playground-account/eu-west-1/s3] terraform:         }
00:23:37.678 STDOUT [playground-account/eu-west-1/s3] terraform:       + tags_all                    = {
00:23:37.678 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
00:23:37.678 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Name"        = "test-bucket-tag-maltamash"
00:23:37.678 STDOUT [playground-account/eu-west-1/s3] terraform:         }
00:23:37.678 STDOUT [playground-account/eu-west-1/s3] terraform:       + website_domain              = (known after apply)
00:23:37.679 STDOUT [playground-account/eu-west-1/s3] terraform:       + website_endpoint            = (known after apply)
00:23:37.679 STDOUT [playground-account/eu-west-1/s3] terraform:       + cors_rule (known after apply)
00:23:37.679 STDOUT [playground-account/eu-west-1/s3] terraform:       + grant (known after apply)
00:23:37.679 STDOUT [playground-account/eu-west-1/s3] terraform:       + lifecycle_rule (known after apply)
00:23:37.679 STDOUT [playground-account/eu-west-1/s3] terraform:       + logging (known after apply)
00:23:37.679 STDOUT [playground-account/eu-west-1/s3] terraform:       + object_lock_configuration (known after apply)
00:23:37.679 STDOUT [playground-account/eu-west-1/s3] terraform:       + replication_configuration (known after apply)
00:23:37.679 STDOUT [playground-account/eu-west-1/s3] terraform:       + server_side_encryption_configuration (known after apply)
00:23:37.679 STDOUT [playground-account/eu-west-1/s3] terraform:       + versioning (known after apply)
00:23:37.679 STDOUT [playground-account/eu-west-1/s3] terraform:       + website (known after apply)
00:23:37.679 STDOUT [playground-account/eu-west-1/s3] terraform:     }
00:23:37.679 STDOUT [playground-account/eu-west-1/s3] terraform:   # aws_s3_bucket.this["test-bucket-two-mo-altamash"] will be created
00:23:37.679 STDOUT [playground-account/eu-west-1/s3] terraform:   + resource "aws_s3_bucket" "this" {
00:23:37.679 STDOUT [playground-account/eu-west-1/s3] terraform:       + acceleration_status         = (known after apply)
00:23:37.679 STDOUT [playground-account/eu-west-1/s3] terraform:       + acl                         = (known after apply)
00:23:37.679 STDOUT [playground-account/eu-west-1/s3] terraform:       + arn                         = (known after apply)
00:23:37.679 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket                      = "test-bucket-two-mo-altamash"
00:23:37.679 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_domain_name          = (known after apply)
00:23:37.679 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_prefix               = (known after apply)
00:23:37.679 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_region               = (known after apply)
00:23:37.679 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_regional_domain_name = (known after apply)
00:23:37.679 STDOUT [playground-account/eu-west-1/s3] terraform:       + force_destroy               = false
00:23:37.679 STDOUT [playground-account/eu-west-1/s3] terraform:       + hosted_zone_id              = (known after apply)
00:23:37.679 STDOUT [playground-account/eu-west-1/s3] terraform:       + id                          = (known after apply)
00:23:37.679 STDOUT [playground-account/eu-west-1/s3] terraform:       + object_lock_enabled         = (known after apply)
00:23:37.679 STDOUT [playground-account/eu-west-1/s3] terraform:       + policy                      = (known after apply)
00:23:37.679 STDOUT [playground-account/eu-west-1/s3] terraform:       + region                      = "eu-west-1"
00:23:37.679 STDOUT [playground-account/eu-west-1/s3] terraform:       + request_payer               = (known after apply)
00:23:37.679 STDOUT [playground-account/eu-west-1/s3] terraform:       + tags                        = {
00:23:37.680 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
00:23:37.680 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Name"        = "test-bucket-tag-maltamash"
00:23:37.680 STDOUT [playground-account/eu-west-1/s3] terraform:         }
00:23:37.680 STDOUT [playground-account/eu-west-1/s3] terraform:       + tags_all                    = {
00:23:37.680 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
00:23:37.680 STDOUT [playground-account/eu-west-1/s3] terraform:           + "Name"        = "test-bucket-tag-maltamash"
00:23:37.680 STDOUT [playground-account/eu-west-1/s3] terraform:         }
00:23:37.680 STDOUT [playground-account/eu-west-1/s3] terraform:       + website_domain              = (known after apply)
00:23:37.680 STDOUT [playground-account/eu-west-1/s3] terraform:       + website_endpoint            = (known after apply)
00:23:37.680 STDOUT [playground-account/eu-west-1/s3] terraform:       + cors_rule (known after apply)
00:23:37.680 STDOUT [playground-account/eu-west-1/s3] terraform:       + grant (known after apply)
00:23:37.680 STDOUT [playground-account/eu-west-1/s3] terraform:       + lifecycle_rule (known after apply)
00:23:37.680 STDOUT [playground-account/eu-west-1/s3] terraform:       + logging (known after apply)
00:23:37.680 STDOUT [playground-account/eu-west-1/s3] terraform:       + object_lock_configuration (known after apply)
00:23:37.680 STDOUT [playground-account/eu-west-1/s3] terraform:       + replication_configuration (known after apply)
00:23:37.680 STDOUT [playground-account/eu-west-1/s3] terraform:       + server_side_encryption_configuration (known after apply)
00:23:37.680 STDOUT [playground-account/eu-west-1/s3] terraform:       + versioning (known after apply)
00:23:37.680 STDOUT [playground-account/eu-west-1/s3] terraform:       + website (known after apply)
00:23:37.680 STDOUT [playground-account/eu-west-1/s3] terraform:     }
00:23:37.680 STDOUT [playground-account/eu-west-1/s3] terraform: Plan: 2 to add, 0 to change, 0 to destroy.
00:23:37.680 STDOUT [playground-account/eu-west-1/s3] terraform: 
00:23:37.680 STDOUT [playground-account/eu-west-1/s3] terraform: Changes to Outputs:
00:23:37.680 STDOUT [playground-account/eu-west-1/s3] terraform:   + bucket_id = {
00:23:37.680 STDOUT [playground-account/eu-west-1/s3] terraform:       + test-bucket-one-mo-altamash = (known after apply)
00:23:37.680 STDOUT [playground-account/eu-west-1/s3] terraform:       + test-bucket-two-mo-altamash = (known after apply)
00:23:37.680 STDOUT [playground-account/eu-west-1/s3] terraform:     }
00:23:38.823 STDOUT [management-account/eu-west-1/s3] terraform: Terraform used the selected providers to generate the following execution
00:23:38.823 STDOUT [management-account/eu-west-1/s3] terraform: plan. Resource actions are indicated with the following symbols:
00:23:38.823 STDOUT [management-account/eu-west-1/s3] terraform:   + create
00:23:38.823 STDOUT [management-account/eu-west-1/s3] terraform:   - destroy
00:23:38.823 STDOUT [management-account/eu-west-1/s3] terraform: Terraform will perform the following actions:
00:23:38.824 STDOUT [management-account/eu-west-1/s3] terraform:   # aws_s3_bucket.this["ma-test-bucket-terragrunt-main-account"] will be destroyed
00:23:38.824 STDOUT [management-account/eu-west-1/s3] terraform:   # (because key ["ma-test-bucket-terragrunt-main-account"] is not in for_each map)
00:23:38.824 STDOUT [management-account/eu-west-1/s3] terraform:   - resource "aws_s3_bucket" "this" {
00:23:38.824 STDOUT [management-account/eu-west-1/s3] terraform:       - arn                         = "arn:aws:s3:::ma-test-bucket-terragrunt-main-account" -> null
00:23:38.824 STDOUT [management-account/eu-west-1/s3] terraform:       - bucket                      = "ma-test-bucket-terragrunt-main-account" -> null
00:23:38.824 STDOUT [management-account/eu-west-1/s3] terraform:       - bucket_domain_name          = "ma-test-bucket-terragrunt-main-account.s3.amazonaws.com" -> null
00:23:38.824 STDOUT [management-account/eu-west-1/s3] terraform:       - bucket_region               = "eu-west-1" -> null
00:23:38.824 STDOUT [management-account/eu-west-1/s3] terraform:       - bucket_regional_domain_name = "ma-test-bucket-terragrunt-main-account.s3.eu-west-1.amazonaws.com" -> null
00:23:38.824 STDOUT [management-account/eu-west-1/s3] terraform:       - force_destroy               = false -> null
00:23:38.824 STDOUT [management-account/eu-west-1/s3] terraform:       - hosted_zone_id              = "Z1BKCTXD74EZPE" -> null
00:23:38.824 STDOUT [management-account/eu-west-1/s3] terraform:       - id                          = "ma-test-bucket-terragrunt-main-account" -> null
00:23:38.824 STDOUT [management-account/eu-west-1/s3] terraform:       - object_lock_enabled         = false -> null
00:23:38.824 STDOUT [management-account/eu-west-1/s3] terraform:       - region                      = "eu-west-1" -> null
00:23:38.824 STDOUT [management-account/eu-west-1/s3] terraform:       - request_payer               = "BucketOwner" -> null
00:23:38.824 STDOUT [management-account/eu-west-1/s3] terraform:       - tags                        = {
00:23:38.824 STDOUT [management-account/eu-west-1/s3] terraform:           - "Environment" = "test-env"
00:23:38.824 STDOUT [management-account/eu-west-1/s3] terraform:           - "Name"        = "ma-test-bucket-tag"
00:23:38.824 STDOUT [management-account/eu-west-1/s3] terraform:         } -> null
00:23:38.824 STDOUT [management-account/eu-west-1/s3] terraform:       - tags_all                    = {
00:23:38.824 STDOUT [management-account/eu-west-1/s3] terraform:           - "Environment" = "test-env"
00:23:38.825 STDOUT [management-account/eu-west-1/s3] terraform:           - "Name"        = "ma-test-bucket-tag"
00:23:38.825 STDOUT [management-account/eu-west-1/s3] terraform:         } -> null
00:23:38.825 STDOUT [management-account/eu-west-1/s3] terraform:         # (3 unchanged attributes hidden)
00:23:38.825 STDOUT [management-account/eu-west-1/s3] terraform:       - grant {
00:23:38.825 STDOUT [management-account/eu-west-1/s3] terraform:           - id          = "fb3a504c2c3b80cce97fc2bdc3b54f23c6a053294b59038773062668af2c2a6f" -> null
00:23:38.825 STDOUT [management-account/eu-west-1/s3] terraform:           - permissions = [
00:23:38.825 STDOUT [management-account/eu-west-1/s3] terraform:               - "FULL_CONTROL",
00:23:38.825 STDOUT [management-account/eu-west-1/s3] terraform:             ] -> null
00:23:38.825 STDOUT [management-account/eu-west-1/s3] terraform:           - type        = "CanonicalUser" -> null
00:23:38.825 STDOUT [management-account/eu-west-1/s3] terraform:             # (1 unchanged attribute hidden)
00:23:38.825 STDOUT [management-account/eu-west-1/s3] terraform:         }
00:23:38.825 STDOUT [management-account/eu-west-1/s3] terraform:       - server_side_encryption_configuration {
00:23:38.825 STDOUT [management-account/eu-west-1/s3] terraform:           - rule {
00:23:38.825 STDOUT [management-account/eu-west-1/s3] terraform:               - bucket_key_enabled = false -> null
00:23:38.825 STDOUT [management-account/eu-west-1/s3] terraform:               - apply_server_side_encryption_by_default {
00:23:38.825 STDOUT [management-account/eu-west-1/s3] terraform:                   - sse_algorithm     = "AES256" -> null
00:23:38.825 STDOUT [management-account/eu-west-1/s3] terraform:                     # (1 unchanged attribute hidden)
00:23:38.825 STDOUT [management-account/eu-west-1/s3] terraform:                 }
00:23:38.825 STDOUT [management-account/eu-west-1/s3] terraform:             }
00:23:38.825 STDOUT [management-account/eu-west-1/s3] terraform:         }
00:23:38.825 STDOUT [management-account/eu-west-1/s3] terraform:       - versioning {
00:23:38.825 STDOUT [management-account/eu-west-1/s3] terraform:           - enabled    = false -> null
00:23:38.825 STDOUT [management-account/eu-west-1/s3] terraform:           - mfa_delete = false -> null
00:23:38.825 STDOUT [management-account/eu-west-1/s3] terraform:         }
00:23:38.826 STDOUT [management-account/eu-west-1/s3] terraform:     }
00:23:38.826 STDOUT [management-account/eu-west-1/s3] terraform:   # aws_s3_bucket.this["test-bucket-main-mo-altamash"] will be created
00:23:38.826 STDOUT [management-account/eu-west-1/s3] terraform:   + resource "aws_s3_bucket" "this" {
00:23:38.826 STDOUT [management-account/eu-west-1/s3] terraform:       + acceleration_status         = (known after apply)
00:23:38.826 STDOUT [management-account/eu-west-1/s3] terraform:       + acl                         = (known after apply)
00:23:38.826 STDOUT [management-account/eu-west-1/s3] terraform:       + arn                         = (known after apply)
00:23:38.826 STDOUT [management-account/eu-west-1/s3] terraform:       + bucket                      = "test-bucket-main-mo-altamash"
00:23:38.826 STDOUT [management-account/eu-west-1/s3] terraform:       + bucket_domain_name          = (known after apply)
00:23:38.826 STDOUT [management-account/eu-west-1/s3] terraform:       + bucket_prefix               = (known after apply)
00:23:38.826 STDOUT [management-account/eu-west-1/s3] terraform:       + bucket_region               = (known after apply)
00:23:38.826 STDOUT [management-account/eu-west-1/s3] terraform:       + bucket_regional_domain_name = (known after apply)
00:23:38.826 STDOUT [management-account/eu-west-1/s3] terraform:       + force_destroy               = false
00:23:38.826 STDOUT [management-account/eu-west-1/s3] terraform:       + hosted_zone_id              = (known after apply)
00:23:38.826 STDOUT [management-account/eu-west-1/s3] terraform:       + id                          = (known after apply)
00:23:38.826 STDOUT [management-account/eu-west-1/s3] terraform:       + object_lock_enabled         = (known after apply)
00:23:38.826 STDOUT [management-account/eu-west-1/s3] terraform:       + policy                      = (known after apply)
00:23:38.826 STDOUT [management-account/eu-west-1/s3] terraform:       + region                      = "eu-west-1"
00:23:38.826 STDOUT [management-account/eu-west-1/s3] terraform:       + request_payer               = (known after apply)
00:23:38.826 STDOUT [management-account/eu-west-1/s3] terraform:       + tags                        = {
00:23:38.826 STDOUT [management-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
00:23:38.826 STDOUT [management-account/eu-west-1/s3] terraform:           + "Name"        = "test-bucket-main-ma"
00:23:38.826 STDOUT [management-account/eu-west-1/s3] terraform:         }
00:23:38.826 STDOUT [management-account/eu-west-1/s3] terraform:       + tags_all                    = {
00:23:38.826 STDOUT [management-account/eu-west-1/s3] terraform:           + "Environment" = "test-env"
00:23:38.826 STDOUT [management-account/eu-west-1/s3] terraform:           + "Name"        = "test-bucket-main-ma"
00:23:38.826 STDOUT [management-account/eu-west-1/s3] terraform:         }
00:23:38.826 STDOUT [management-account/eu-west-1/s3] terraform:       + website_domain              = (known after apply)
00:23:38.826 STDOUT [management-account/eu-west-1/s3] terraform:       + website_endpoint            = (known after apply)
00:23:38.827 STDOUT [management-account/eu-west-1/s3] terraform:       + cors_rule (known after apply)
00:23:38.827 STDOUT [management-account/eu-west-1/s3] terraform:       + grant (known after apply)
00:23:38.827 STDOUT [management-account/eu-west-1/s3] terraform:       + lifecycle_rule (known after apply)
00:23:38.827 STDOUT [management-account/eu-west-1/s3] terraform:       + logging (known after apply)
00:23:38.827 STDOUT [management-account/eu-west-1/s3] terraform:       + object_lock_configuration (known after apply)
00:23:38.827 STDOUT [management-account/eu-west-1/s3] terraform:       + replication_configuration (known after apply)
00:23:38.827 STDOUT [management-account/eu-west-1/s3] terraform:       + server_side_encryption_configuration (known after apply)
00:23:38.827 STDOUT [management-account/eu-west-1/s3] terraform:       + versioning (known after apply)
00:23:38.827 STDOUT [management-account/eu-west-1/s3] terraform:       + website (known after apply)
00:23:38.827 STDOUT [management-account/eu-west-1/s3] terraform:     }
00:23:38.827 STDOUT [management-account/eu-west-1/s3] terraform: Plan: 1 to add, 0 to change, 1 to destroy.
00:23:38.827 STDOUT [management-account/eu-west-1/s3] terraform: 
00:23:38.827 STDOUT [management-account/eu-west-1/s3] terraform: Changes to Outputs:
00:23:38.827 STDOUT [management-account/eu-west-1/s3] terraform:   ~ bucket_id = {
00:23:38.827 STDOUT [management-account/eu-west-1/s3] terraform:       - ma-test-bucket-terragrunt-main-account = "ma-test-bucket-terragrunt-main-account"
00:23:38.827 STDOUT [management-account/eu-west-1/s3] terraform:       + test-bucket-main-mo-altamash           = (known after apply)
00:23:38.827 STDOUT [management-account/eu-west-1/s3] terraform:     }
```

</details>
    
